1226822570/duogongnengwenshiduji/D/ArmPacks/.Web/SiliconLabs.GeckoPlatform_EFR32BG14P_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>SiliconLabs</vendor>
  <url>https://www.silabs.com/documents/public/cmsis-packs/</url>
  <name>GeckoPlatform_EFR32BG14P_DFP</name>
  <description>Silicon Labs EFR32BG14P Blue Gecko Series Device Support.</description>

  <releases>
    <release version="2.7.3" date="2020-03-23">
      The PRORTC timer peripheral has been added to EFR32xG13 and EFR32xG14 device families.
    </release>
    <release version="2.7.0" date="2019-11-12">
      Changed pack names and version number sequence.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Silicon Labs</keyword>
    <keyword>EFR32BG14P</keyword>
    <keyword>EFR32</keyword>
    <keyword>Blue Gecko</keyword>
    <keyword>Gecko</keyword>
  </keywords>

  <devices>
    <family Dfamily="EFR32BG14P Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <processor Dclock="38400000"/>
      <book name="Documents/cortex_m4_dgug.pdf"      title="Cortex-M4 Generic User Guide"/>
      <book name="Documents/efr32xg14-rm.pdf"  title="EFR32BG14P Reference Manual"/>
      <description>
- 32-bit ARM Cortex-M4 core with 40 MHz maximum operating frequency&#xD;&#xA;- Scalable Memory and Radio configuration options available in several footprint compatible QFN packages&#xD;&#xA;- 12-channel Peripheral Reflex System enabling autonomous interaction of MCU peripherals&#xD;&#xA;- Autonomous Hardware Crypto Accelerator and True Random Number Generator&#xD;&#xA;- Integrated balun for 2.4 GHz and integrated PA with up to 19 dBm transmit power for 2.4 GHz and 20 dBm transmit power for Sub-GHz radios&#xD;&#xA;- Integrated DC-DC with RF noise mitigation&#xD;&#xA;- Integrated PLFRCO eliminates external 32 kHz crystal for BLE applications&#xD;&#xA;&#xD;&#xA;The Wireless Gecko portfolio of SoCs (EFR32) includes Mighty Gecko (EFR32MG14), Blue Gecko (EFR32BG14), and Flex Gecko (EFR32FG14) families. With support for Zigbee, Thread, Bluetooth Low Energy (BLE) and proprietary protocols, the Wireless Gecko portfolio is ideal for enabling energy-friendly wireless networking for IoT devices. The single-die solution provides industry-leading energy efficiency, ultra-fast wakeup times, a scalable high-power amplifier, an integrated balun and no-compromise MCU features.
      </description>

      <subFamily DsubFamily="EFR32BG14P532">
        <book         name="Documents/efr32bg14-datasheet.pdf"      title="EFR32BG14P532 Data Sheet"/>
        <book         name="Documents/efr32bg14-errata.pdf"         title="EFR32BG14P532 Errata"/>
        <!-- *************************  Device 'EFR32BG14P532F256GM32'  ***************************** -->
        <device Dname="EFR32BG14P532F256GM32">
          <compile header="Device/SiliconLabs/EFR32BG14P/Include/em_device.h"  define="EFR32BG14P532F256GM32"/>
          <debug      svd="SVD/EFR32BG14P/EFR32BG14P532F256GM32.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00040000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00040000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32BG14P532F256GM48'  ***************************** -->
        <device Dname="EFR32BG14P532F256GM48">
          <compile header="Device/SiliconLabs/EFR32BG14P/Include/em_device.h"  define="EFR32BG14P532F256GM48"/>
          <debug      svd="SVD/EFR32BG14P/EFR32BG14P532F256GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00040000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00040000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32BG14P632">
        <book         name="Documents/efr32bg14-datasheet.pdf"      title="EFR32BG14P632 Data Sheet"/>
        <book         name="Documents/efr32bg14-errata.pdf"         title="EFR32BG14P632 Errata"/>
        <!-- *************************  Device 'EFR32BG14P632F256GM32'  ***************************** -->
        <device Dname="EFR32BG14P632F256GM32">
          <compile header="Device/SiliconLabs/EFR32BG14P/Include/em_device.h"  define="EFR32BG14P632F256GM32"/>
          <debug      svd="SVD/EFR32BG14P/EFR32BG14P632F256GM32.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00040000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00040000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32BG14P632F256GM48'  ***************************** -->
        <device Dname="EFR32BG14P632F256GM48">
          <compile header="Device/SiliconLabs/EFR32BG14P/Include/em_device.h"  define="EFR32BG14P632F256GM48"/>
          <debug      svd="SVD/EFR32BG14P/EFR32BG14P632F256GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00040000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00040000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32BG14P632F256IM32'  ***************************** -->
        <device Dname="EFR32BG14P632F256IM32">
          <compile header="Device/SiliconLabs/EFR32BG14P/Include/em_device.h"  define="EFR32BG14P632F256IM32"/>
          <debug      svd="SVD/EFR32BG14P/EFR32BG14P632F256IM32.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00040000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00040000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32BG14P632F256IM48'  ***************************** -->
        <device Dname="EFR32BG14P632F256IM48">
          <compile header="Device/SiliconLabs/EFR32BG14P/Include/em_device.h"  define="EFR32BG14P632F256IM48"/>
          <debug      svd="SVD/EFR32BG14P/EFR32BG14P632F256IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00040000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00040000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32BG14P732">
        <book         name="Documents/efr32bg14-datasheet.pdf"      title="EFR32BG14P732 Data Sheet"/>
        <book         name="Documents/efr32bg14-errata.pdf"         title="EFR32BG14P732 Errata"/>
        <!-- *************************  Device 'EFR32BG14P732F256GM32'  ***************************** -->
        <device Dname="EFR32BG14P732F256GM32">
          <compile header="Device/SiliconLabs/EFR32BG14P/Include/em_device.h"  define="EFR32BG14P732F256GM32"/>
          <debug      svd="SVD/EFR32BG14P/EFR32BG14P732F256GM32.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00040000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00040000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32BG14P732F256GM48'  ***************************** -->
        <device Dname="EFR32BG14P732F256GM48">
          <compile header="Device/SiliconLabs/EFR32BG14P/Include/em_device.h"  define="EFR32BG14P732F256GM48"/>
          <debug      svd="SVD/EFR32BG14P/EFR32BG14P732F256GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00040000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00040000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32BG14P733">
        <book         name="Documents/efr32bg14-datasheet.pdf"      title="EFR32BG14P733 Data Sheet"/>
        <book         name="Documents/efr32bg14-errata.pdf"         title="EFR32BG14P733 Errata"/>
        <!-- *************************  Device 'EFR32BG14P733F256GM48'  ***************************** -->
        <device Dname="EFR32BG14P733F256GM48">
          <compile header="Device/SiliconLabs/EFR32BG14P/Include/em_device.h"  define="EFR32BG14P733F256GM48"/>
          <debug      svd="SVD/EFR32BG14P/EFR32BG14P733F256GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00040000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x20000000"  size="0x00008000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS1.FLM"  start="0x00000000"  size="0x00040000"  RAMstart="0x20000000" RAMsize="0x4000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS1.flash"  start="0x00000000"  size="0x00040000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFR32BG14P">
      <description>Silicon Labs EFR32BG14P device series</description>
      <require Dvendor="Silicon Labs:21" Dname="EFR32BG14P*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.7.3" condition="EFR32BG14P">
      <description>System Startup for Silicon Labs EFR32BG14P device series</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/SiliconLabs/EFR32BG14P/Include/"/>
        <file category="header"  name="Device/SiliconLabs/EFR32BG14P/Include/em_device.h"/>
        <!-- startup files -->
        <file category="source"  name="Device/SiliconLabs/EFR32BG14P/Source/ARM/startup_efr32bg14p.s" condition="Compiler ARMCC" attr="config" version="2.7.3"/>
        <file category="source"  name="Device/SiliconLabs/EFR32BG14P/Source/GCC/startup_efr32bg14p.S" condition="Compiler GCC"   attr="config" version="2.7.3"/>
        <!-- linker command file -->
        <file category="linkerScript"  name="Device/SiliconLabs/EFR32BG14P/Source/GCC/efr32bg14p.ld" condition="Compiler GCC" attr="config" version="2.7.3"/>
        <!-- system file -->
        <file category="source"  name="Device/SiliconLabs/EFR32BG14P/Source/system_efr32bg14p.c" attr="config" version="2.7.3"/>
      </files>
    </component>
  </components>
</package>
